#include "s21_tetris.h"
#define ROWS 20
#define COLUMNS 10

void move_down(char(*field)[COLUMNS], char(*shape)[2], int* current_x, int* current_y);
void print_field(char(*field)[COLUMNS]);

int main(void) {
   char field[ROWS][COLUMNS] = {
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'},
                        {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0'}
};

   int current_x = 4, current_y = 0;
   char shape[2][2] = {{'1', '1'}, {'1', '1'}};
       for (int i = 0; i < 2; i++) { // Инициализируем начальную позицию фигурки
        for (int j = 0; j < 2; j++) {
            if (shape[i][j] == '1') {
                field[i + current_y][j + current_x] = '1';
            }
        }
    }
    move_down(field, shape, &current_x, &current_y);
    print_field(field);

}

void print_field(char(*field)[COLUMNS]) {
    for (int i = 0; i < ROWS; i++) {
        for (int j = 0; j < COLUMNS; j++) {
            printf("%c ", field[i][j]);
      }
   printf("\n");
   }
   printf("\n");
}


void move_down(char(*field)[COLUMNS], char(*shape)[2], int* current_x, int* current_y) {
    char shape[2][2] = {{'1', '1'}, {'1', '1'}};
       for (int i = 0; i < 2; i++) { // Инициализируем начальную позицию фигурки
        for (int j = 0; j < 2; j++) {
            if (shape[i][j] == '1') {
                field[i + *current_y][j + *current_x] = '0';
            }
        }
    }
}
